#+title: PyAmg notes
#+date: <2021-05-15 Sat>
#+lastmod: 2021-09-15 13:40:51
#+author: Nasser Alkmim
#+email: nasser.alkmim@gmail.com
#+draft: t
#+toc: t
#+tags[]: python numerical-analysis
** Testing
From the home page example:

#+begin_src python
import pyamg
import numpy as np
A = pyamg.gallery.poisson((500,500), format='csr')  # 2D Poisson problem on 500x500 grid
ml = pyamg.ruge_stuben_solver(A)                    # construct the multigrid hierarchy
print(ml)                                           # print hierarchy information
b = np.random.rand(A.shape[0])                      # pick a random right hand side
x = ml.solve(b, tol=1e-10)                          # solve Ax=b to a tolerance of 1e-10
print("residual: ", np.linalg.norm(b-A*x))          # compute norm of residual vector
#+end_src

#+RESULTS:
#+begin_example
multilevel_solver
Number of Levels:     9
Operator Complexity:  2.199
Grid Complexity:      1.667
Coarse Solver:        'pinv2'
  level   unknowns     nonzeros
    0       250000      1248000 [45.48%]
    1       125000      1121002 [40.85%]
    2        31372       280840 [10.23%]
    3         7875        70363 [ 2.56%]
    4         1955        17621 [ 0.64%]
    5          508         4824 [ 0.18%]
    6          122         1240 [ 0.05%]
    7           30          270 [ 0.01%]
    8            8           58 [ 0.00%]
residual:  1.7663185707792206e-08
#+end_example
